Revit 2027 API
RebarShapeConstraintDiameter.ArcReferenceType Property
 The choice of rule for measuring the diameter.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeArcReferenceType ArcReferenceType { get; }
Public ReadOnly Property ArcReferenceType As RebarShapeArcReferenceType
	Get
public:
property RebarShapeArcReferenceType ArcReferenceType {
	RebarShapeArcReferenceType get ();
}
member ArcReferenceType : RebarShapeArcReferenceType with get
Property Value
RebarShapeArcReferenceType
See Also
Reference
RebarShapeConstraintDiameter Class
Autodesk.Revit.DB.Structure Namespace